{"58":"X","4173766":"HERO ","39717916":"Gain access to the Hometown Hero newsletter. Just enter your information below and your in the club!","60895337":"Ashton Burrell is the Founder of Hometown Hero and has spent the entirety of his adult life motivating people to achieve. Find out how to can book Ashton for your next event below.","-6f2ece0f":"A Breakdown Of Impact","-2e0bae0e":"The breakdown of impact is a guide to be of help in your everyday life. It is written the with the raw feelings of how Ashton Burrell breaks down the word IMPACT. This book is encouraging and uplifting to people all over this world. We all go through this thing called life so let’s make our IMPACT while we are here!","4651ab42":"Available Now!","6bc36921":"Purchase","2ab723ad":"Enter The Club","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form.","11b9c7f1":"HOMETOWN","21c7fa":"HERO","78873e6f":"DONATE","-7f24ffa2":"SERVICES","-661b9023":"TEAM HERO","26d2f6":"SHOP","-613abdfb":"GOFUNDME","4b6f3ec9":"HOMETOWN HERO","-1a3d8e83":"Building Community","1585bd72":"Connecting Brands To Local Leaders.","-62057db7":"Work With Us","257f364f":"HOMETOWN ","6c658348":"It takes a village to raise a child and teach them how to grow into productive members of society.  By giving the next generation solid examples of what it takes to reach the next level in life is important and cant be replaced. Though positive association we are providing the steps and guidance to development the next generation of Hometown Heroes . To have closer communities our local leaders must receive the credit and attention needed to inspire children to grow up and value our everyday heroes, that to  often goes without receiving the proper credit.","-508e913f":"WHAT WE DO","7b4f695c":"Youth Programs","-7505c94c":"Children are the future and the foundation of our society. Give us the opportunity to create programs on behalf of your organization that will impact the youth for generations to come.","6382b000":"CONTACT","-1cc763e3":"Mentorship Training","54fe71ac":"Building culture is a process. Allow our team of experts to help develop the leaders in your organization to better serve the local community.","478386ef":"Brand Consulting","e932042":"Expand your brand and expand your impact at the same time. Get in contact with us so that we can create a customized brand strategy for your organization.","-7e5cad9d":"Event Planning","35c97a49":"Events are a great way to convey a precise message to the masses all at once. Let us help your organization from start to finish create a gathering a like minds that will help propel your companies vision and future endeavors.","2610d078":"Previous Partnerships","-48c469d7":"WORK WITH US","e0154a1":"Find out how we can help build your brand in the community.","119ca21b":"FIRST NAME","1c6105d5":"LAST NAME","3f0537c":"EMAIL","4b8cc71":"STATE","2536f3ac":"ZIP CODE","527e545a":"Select For Speaking Request","-24201a5":"PHONE NUMBER","696d03dd":"Team Hero","-37ee3c5b":"One is good but more is better. Join the team and find out how you can be apart of building local communities with community.","-33bd7a9":"MORE DETAILS","5c35f736":"Shoot Hoops Not Guns","5d8005a4":"Shoot Guns Not Hoops is our signature multi city basketball youth program to help combat gun violence throughout inner city communities. Explore how you can join us for our next event.","73689ea7":"Public Speaking","52c5e91f":"SPEAKING REQUEST","-6d048256":"WATCH VIDEO","165f3d2b":"Shop & Support","-7370993e":"Purchase some merchandise and support a cause. Every dollar earned is another dollar to invest into our communities.","1a08228c":"SHOP NOW","-6de4f493":"SOCIAL","12a651d0":"info@hometownhero.com","6b90d0a2":"Originals","274f16":"Shop","-149ae0d8":"SITE CREATED BY","43a37d47":"www.myydesign.com","21ecdf":"HOME","-316f8df1":"Select For Details & Purchasing Options","3d503d2b":"No items found.","2c232b02":"JOIN THE TEAM","-73a884e6":"Keep Scrolling","-72b94e4e":"Team Hero was establish by Ashton Burrell with the premise of creating opportunities in communities that are often overlooked and under funded.","-31d80897":"Over the years with the help of community leaders around the country and countless donations Team Hero has been able to establish community programs, initiatives, & events that have impacted thousands.","-4743bc21":"Be the change and find out how you can contribute to Team Hero below.","-304bd141":"Submit a donation of your choosing. All proceeds go towards funding local events, initiatives, and programs created by Team Hero.","-7772c166":"SUBMIT DONATION","22d52a":"JOIN","4c5f011c":"Be the change in your community. Team Hero is always looking to expand and partner with local leaders. Contact us today to see how you can join Team Hero and host one of our programs in your community.","253fd2be":"CONTACT US","-65c93f5e":"ORIGINALS","6b4315e6":"YOU MAY ALSO LIKE:","-6aab683b":"WATCH NOW","d790f16":"SHOOT HOOPS NOT GUNS","-164571":"Shoot Hoops Not Guns is a basketball program created by Hometown Hero. The focus of this program is to negate gun violence in inner city communities.","3233cdf5":"With in just a few years this program has expanded to multiple cities around the country.","f72dd4":"See how you can intend one of our next events below."}